{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_10","layers":[{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true,"batch_input_shape":[null,300],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true}},{"class_name":"Dense","config":{"units":6,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense30","trainable":true}}]},"keras_version":"tfjs-layers 2.8.6","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.6","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense28/kernel","shape":[300,50],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense29/kernel","shape":[50,15],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense30/kernel","shape":[15,6],"dtype":"float32"},{"name":"dense_Dense30/bias","shape":[6],"dtype":"float32"}]}]}